daviskung/RTL8762_HM/Source/Application/RT-DK-HR8001-HRP/ota_application.c
/**
*********************************************************************************************************
*               Copyright(c) 2015, Realtek Semiconductor Corporation. All rights reserved.
**********************************************************************************************************
* @file     ota_application.c
* @brief
* @details
* @author   hunter_shuai
* @date     14-July-2015
* @version  v1.0.0
******************************************************************************
* @attention
* <h2><center>&copy; COPYRIGHT 2015 Realtek Semiconductor Corporation</center></h2>
******************************************************************************
*/
#include <stdio.h>
#include "rtl876x.h"
#include "application.h"
#include "bee_message.h"
#include "trace.h"
#include "peripheral.h"
#include "gap.h"
#include "gapbondmgr.h"
#include "profileApi.h"
#include "ota_service.h"
#include "hrm_service.h"
#include "ota_application.h"
#include "string.h"
#include "rtl876x_adc.h"
#include "rtl_types.h"
#include "ota_api.h"
#include "hal_wdg.h"
#include "bas.h"
#include "dis.h"
#include "hrs.h"
#include "version.h"
#include "stdio.h"
#include "portmacro.h"
#include "dlps_platform.h"
#include "task.h"

#include "timers.h"
#include "rtl876x_uart.h"

#define 	VOLT_3V5	0x61f4
#define 	VOLT_4V2	0x6baf


// gap state
gaprole_States_t gapProfileState = GAPSTATE_INIT;
extern xQueueHandle hHeartRateQueueHandle;

extern xTimerHandle hPAH8001_Timer;
extern xTimerHandle hKEYscan_Timer;



/* import service id */
extern uint8_t gDISServiceId;
extern uint8_t gBASServiceId;
extern uint8_t gHRSServiceId;
extern uint8_t gOTAServiceId;
extern uint8_t gHRMServiceId;

/* import advdata */
extern uint8_t advertData[] ;

/* import heart rate */
extern uint8_t _myHR;


extern uint8_t heart_rate_value[];
extern uint16_t heart_rate_size;

extern uint16_t adcConvertRes_HM[ARY_SIZE];



uint8_t gBASBatteryLevel = 0;
bool gSwitchIntoOtaPending = false;

/* flag  */
bool is_battery_notification_enabled = false;
bool is_heart_rate_service_notification_enabled = false;
bool is_heart_rate_monitor_notification_enabled = false;

void SwitchIntoOTAmode(void);
void peripheral_HandleBtGapMessage(BEE_IO_MSG  *pBeeIoMsg);


/******************************************************************
 * @fn         AppHandleIODriverMessage
 * @brief      All the application events are pre-handled in this function.
 *                All the IO MSGs are sent to this function, Then the event handling function
 *                shall be called according to the MSG type.
 *
 * @param    io_driver_msg_recv  - bee io msg data
 * @return     void
 */
void AppHandleIODriverMessage(BEE_IO_MSG io_driver_msg_recv)
{
	UINT16 msgtype = io_driver_msg_recv.IoType;

	switch(msgtype)
	{
		case BT_STATUS_UPDATE:
			{
				peripheral_HandleBtGapMessage(&io_driver_msg_recv);
			}
			break;

		//add more IO driver message type case here
		//IO driver messge tye should be defined in bee_message.h
		
		default:
			break;
	}
}


/******************************************************************
 * @fn       peripheral_HandleBtGapStateChangeEvt
 * @brief    All the gaprole_States_t events are pre-handled in this function.
 *           Then the event handling function shall be called according to the newState.
 *
 * @param    newState  - new gap state
 * @return   void
 */
void peripheral_HandleBtGapStateChangeEvt(uint8_t newState)
{
	
	uint8_t _hr_event;
    switch ( newState )
    {
        //connection is disconnected or idle with no advertising
        case GAPSTATE_IDLE_NO_ADV_NO_CONN:
            {
                if (gapProfileState == GAPSTATE_CONNECTED)
                {
                    uint8_t disc_reason;
                    peripheralGetGapParameter(GAPPRRA_DISCONNECTED_REASON, &disc_reason);
                    DBG_BUFFER(MODULE_APP, LEVEL_INFO, "peripheral_HandleBtGapStateChangeEvt: disc_reason = %d", 1, disc_reason);
					if(gSwitchIntoOtaPending)
					{
						gSwitchIntoOtaPending = false;
						SwitchIntoOTAmode();
					}
					else
					{
						peripheral_StartAdvertising();
					}
                }
            }
            break;
        //device is advertising
        case GAPSTATE_ADVERTISING:
            {
				_hr_event = EVENT_GAPSTATE_ADVERTISING;
				// Send Task
				xQueueSend(hHeartRateQueueHandle, &_hr_event, 1);
            }
            break;

        //device is connected
        case GAPSTATE_CONNECTED:
            {
				_hr_event = EVENT_GAPSTATE_CONNECTED;
				// Send Task
				xQueueSend(hHeartRateQueueHandle, &_hr_event, 1);
            }
            break;

        //device is connected and advertising
        case GAPSTATE_CONNECTED_ADV:
            {

            }
            break;

        //error comes here
        default:
            {

            }
            break;

    }

    gapProfileState = (gaprole_States_t)newState;
}


/******************************************************************
 * @fn       peripheral_HandleBtGapBondStateChangeEvt
 * @brief    All the bonding state change  events are pre-handled in this function.
 *           Then the event handling function shall be called according to the newState.
 *
 * @param    newState  - new bonding state
 * @return   void
 */
void peripheral_HandleBtGapBondStateChangeEvt(uint8_t newState, uint8_t status)
{
    switch (newState)
    {
        case GAPBOND_PAIRING_STATE_STARTED:
            {
                DBG_BUFFER(MODULE_APP, LEVEL_INFO, "BT_MSG_TYPE_BOND_STATE_CHANGE:(GAPBOND_PAIRING_STATE_STARTED)", 0);
            }
            break;

        case GAPBOND_PAIRING_STATE_COMPLETE:
            {
                DBG_BUFFER(MODULE_APP, LEVEL_INFO, "BT_MSG_TYPE_BOND_STATE_CHANGE:(GAPBOND_PAIRING_STATE_COMPLETE)", 0);
                if (status == 0)
                {
                    DBG_BUFFER(MODULE_APP, LEVEL_INFO, "BT_MSG_TYPE_BOND_STATE_CHANGE pair success", 0);
                }
                else
                {
                    DBG_BUFFER(MODULE_APP, LEVEL_ERROR, "BT_MSG_TYPE_BOND_STATE_CHANGE pair failed", 0);
                }
            }
            break;

