daviskung/RTL8762_HM/Source/Application/RT-DK-HR8001-HRP/ota_application.c
}


/*
 * @fn       SwitchIntoOTAmode
 * @brief    enable OTA mode, and prepare to restart system.
 *
 * @param    void
 * @return   void
 */
void SwitchIntoOTAmode(void)
{
	//LPS_MODE_Set(LPM_ACTIVE_MODE);
	vTaskDelay(10);
	portENTER_CRITICAL();
	dfuSetOtaMode(ENABLE);
	HalWatchDogConfig(1, 0, 1);
	HalWatchDogEnable();
	vTaskDelay(60);
	portEXIT_CRITICAL();
	//LPS_MODE_Set(LPM_DLPS_MODE);
}


void UpdateBatteryLevel(void)
{
    uint16_t adcConvertRes,tmpvalue;
	uint16_t	VoltRead;
    //enable ADC read and wait for ADC data ready interrupt
    ADC_Cmd(ADC, ADC_One_Shot_Mode, DISABLE);   //must disable first
    ADC_Cmd(ADC, ADC_One_Shot_Mode, ENABLE);

    /*wait for adc sample ready*/
    while (ADC_GetIntFlagStatus(ADC, ADC_INT_ONE_SHOT_DONE) != SET);
    ADC_ClearINTPendingBit(ADC, ADC_INT_ONE_SHOT_DONE);
    /*read sample result*/
    //adcConvertRes = ADC_Read(ADC, ADC_CH_BAT);
	
    adcConvertRes = ADC_Read(ADC, ADC_CH5);

	
	//DBG_BUFFER(MODULE_APP, LEVEL_INFO, " **BatteryLevel adcConvertRes value = 0x%x \n", 1,adcConvertRes);

	#if 0
    /* return voltage (mV)  */
    if (adcConvertRes < 0x2DF2)
    {
        gBASBatteryLevel = 0;
    }
    else
    {
        /*example formula to calculate battery level, full range is 3.3v*/
        gBASBatteryLevel = (100 * (20 * ((adcConvertRes - 0x2DF2) / 0x10A + 1))) / 0xCE4;
    }
	#endif

	/* return voltage (mV)  */
	//
	// from VOLT_3V5 & VOLT_4V2 to calulate a & b
	// VOLT_3V5 = a * (3.5V) + b
	// VOLT_4V2 = a * (4.2V) + b
	//
	VoltRead = ((adcConvertRes-12596)*100)/3565; // real voltage
	
    if (VoltRead <= 350) // 3.5V
    {
        gBASBatteryLevel = 0;
    }
	else if(VoltRead >= 420)	
		gBASBatteryLevel = 100;
	
    else
    {
		tmpvalue = ((VoltRead - 350)*100)/(420-350);
		
        gBASBatteryLevel = (uint8_t)tmpvalue;
	
        /*example formula to calculate battery level, full range is 3.3v*/
		// tmpvalue = (100 * (adcConvertRes - VOLT_3V5)) / (VOLT_4V2 - VOLT_3V5) ;
        // gBASBatteryLevel = (uint8_t)tmpvalue;
    }
	
	
	DBG_BUFFER(MODULE_APP, LEVEL_INFO, " **BatteryLevel %d adc value = 0x%x volt=%d \n",
		3,tmpvalue,adcConvertRes,VoltRead);
	
    ADC_Cmd(ADC, ADC_One_Shot_Mode, DISABLE);
    BAS_SetParameter(BAS_PARAM_BATTERY_LEVEL, 1, &gBASBatteryLevel);
}


void UpdateHeartRate(void)
{
	//heart_rate_size = sprintf((char *)heart_rate_value, "HR=%03.0f\n", _myHR);
}


/**
 * @brief Notify battery level value to client.
 *
 * @return Result of notify.
 * @retval 0 FALSE
 * @retval 1 TRUE
*/
uint16_t TempHeart;
uint16_t	HeartRate_ENERGY_EXPENDED=0;
uint16_t	HeartRate_RR_Interval=10;


bool HeartRateServiceValueNotify(void)
{
	uint8_t HeartValue[2];

	HEART_RATE_MEASUREMENT_VALUE_FLAG hrs_flag;

	hrs_flag.Heart_Rate_Value_Format_bit = Heart_Rate_Value_Format_UINT8;

	hrs_flag.Sensor_Contact_Status_bits = 3;

	// No Energy Expended
	hrs_flag.Energy_Expended_Status_bit = ON;

	// No RR Interval
	hrs_flag.RR_Interval_bit = ON;

	hrs_flag.RFU = 0;

	HRS_SetParameter(HRS_HEART_RATE_MEASUREMENT_PARAM_FLAG, 1, &hrs_flag);

	TempHeart =(uint16_t)_myHR;
	HeartRate_ENERGY_EXPENDED++;
	HeartRate_RR_Interval++;
	
	
	DBG_BUFFER(MODULE_DRIVERTASK, LEVEL_INFO, "***  Heart rate = %d  \n", 1, TempHeart);
	if(hrs_flag.Heart_Rate_Value_Format_bit == Heart_Rate_Value_Format_UINT16)
	{
		HeartValue[0] = TempHeart>>8; HeartValue[1] = TempHeart&0xFF;
		HRS_SetParameter(HRS_HEART_RATE_MEASUREMENT_PARAM_MEASUREMENT_VALUE, 2, &HeartValue);
	}
	else
	{
		HeartValue[0] = TempHeart&0xFF;
		HRS_SetParameter(HRS_HEART_RATE_MEASUREMENT_PARAM_MEASUREMENT_VALUE, 1, &HeartValue);
	}

	if(hrs_flag.Energy_Expended_Status_bit == ON)
		HRS_SetParameter(HRS_HEART_RATE_MEASUREMENT_PARAM_ENERGY_EXPENDED, 2, &HeartRate_ENERGY_EXPENDED);

	
	if(hrs_flag.RR_Interval_bit == ON)
			HRS_SetParameter(HRS_HEART_RATE_MEASUREMENT_PARAM_RR_INTERVAL, 2, &HeartRate_RR_Interval);


	return HRS_HeartRateMeasurementValueNotify(gHRSServiceId);
}


/******************************************************************
 * @fn       AppProfileCallback
 * @brief    All the bt profile callbacks are handled in this function.
 *           Then the event handling function shall be called according to the serviceID
 *           of BEE_IO_MSG.
 *
 * @param    serviceID  -  service id of profile
 * @param    pData  - pointer to callback data
 * @return   void
 */
TAppResult AppProfileCallback(uint8_t serviceID, void *pData)
{
	TAppResult appResult = AppResult_Success;
	uint8_t uTxBuf[128];
	uint16_t uTxCnt;

	if(serviceID == ProfileAPI_ServiceUndefined)
	{
		TEventInfoCBs_t *pPara = (TEventInfoCBs_t *)pData;

		switch(pPara->eventId)
		{
			case PROFILE_EVT_SRV_REG_COMPLETE:// srv register result event.
				DBG_BUFFER(MODULE_DRIVERTASK, LEVEL_INFO, "profile callback PROFILE_EVT_SRV_REG_COMPLETE\n", 0);
				{
					peripheral_Init_StartAdvertising();
		        }
				break;

			default:
				break;
		}
	}
	else if(serviceID == gDISServiceId)
	{
		TDIS_CALLBACK_DATA *pDisCallbackData = (TDIS_CALLBACK_DATA *)pData;

		switch(pDisCallbackData->msg_type)
		{
			case SERVICE_CALLBACK_TYPE_READ_CHAR_VALUE:
				{
					if (pDisCallbackData->msg_data.read_value_index == DIS_READ_MANU_NAME_INDEX)
					{
						const uint8_t DISManufacturerName[] = "Realtek BT";
						DIS_SetParameter(DIS_PARAM_MANUFACTURER_NAME,
										sizeof(DISManufacturerName),
										(void *)DISManufacturerName);
					}
					else if (pDisCallbackData->msg_data.read_value_index == DIS_READ_MODEL_NUM_INDEX)
					{
					    const uint8_t DISModelNumber[] = "Model Nbr 0.9";
					    DIS_SetParameter(DIS_PARAM_MODEL_NUMBER,
										sizeof(DISModelNumber),
										(void *)DISModelNumber);
					}
					else if (pDisCallbackData->msg_data.read_value_index == DIS_READ_SERIAL_NUM_INDEX)
					{
					    const uint8_t DISSerialNumber[] = "RTKBeeSerialNum";
					    DIS_SetParameter(DIS_PARAM_SERIAL_NUMBER,
										sizeof(DISSerialNumber),
										(void *)DISSerialNumber);
					}
					else if (pDisCallbackData->msg_data.read_value_index == DIS_READ_HARDWARE_REV_INDEX)
					{
					    const uint8_t DISHardwareRev[] = "RTKBeeHardwareRev";
					    DIS_SetParameter(DIS_PARAM_HARDWARE_REVISION,
										sizeof(DISHardwareRev),
										(void *)DISHardwareRev);
					}
					else if (pDisCallbackData->msg_data.read_value_index == DIS_READ_FIRMWARE_REV_INDEX)
					{
					    const uint8_t DISFirmwareRev[] = "RTKBeeFirmwareRev";
					    DIS_SetParameter(DIS_PARAM_FIRMWARE_REVISION,
										sizeof(DISFirmwareRev),
										(void *)DISFirmwareRev);
					}
					else if (pDisCallbackData->msg_data.read_value_index == DIS_READ_SOFTWARE_REV_INDEX)
					{
					    const uint8_t DISSoftwareRev[] = "RTKBeeSoftwareRev";
					    DIS_SetParameter(DIS_PARAM_SOFTWARE_REVISION,
										sizeof(DISSoftwareRev),
										(void *)DISSoftwareRev);
					}
					else if (pDisCallbackData->msg_data.read_value_index == DIS_READ_SYSTEM_ID_INDEX)
					{
					    uint8_t DISSystemID[DIS_SYSTEM_ID_LENGTH] = {0, 1, 2, 0, 0, 3, 4, 5};
					    DIS_SetParameter(DIS_PARAM_SYSTEM_ID,
										sizeof(DISSystemID),
										DISSystemID);
					}
					else if (pDisCallbackData->msg_data.read_value_index == DIS_READ_IEEE_CERT_STR_INDEX)
					{
					    const uint8_t DISIEEEDataList[] = "RTKBeeIEEEDatalist";
					    DIS_SetParameter(DIS_PARAM_IEEE_DATA_LIST,
										sizeof(DISIEEEDataList),
										(void *)DISIEEEDataList);
					}
					else if (pDisCallbackData->msg_data.read_value_index == DIS_READ_PNP_ID_INDEX)
					{
						uint16_t version = VERSION_REVISION;
						uint8_t DISPnpID[DIS_PNP_ID_LENGTH] = {0x01, 0x5D, 0x00, 0x01, 0xF0, (uint8_t)version, (uint8_t)(version >> 8)};
						DIS_SetParameter(DIS_PARAM_PNP_ID,
										sizeof(DISPnpID),
										DISPnpID);
					}
				}
				break;
			default:
			    break;
		}
	}
	else if(serviceID == gBASServiceId)
	{
		TBAS_CALLBACK_DATA *pBasCallbackData = (TBAS_CALLBACK_DATA *)pData;

