daviskung/RTL8762_HM/Source/Application/RT-DK-HR8001-HRP/ota_application.c
		switch(pBasCallbackData->msg_type)
		{
			case SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION:
				{
					if(pBasCallbackData->msg_data.notification_indification_index == BAS_NOTIFY_BATTERY_LEVEL_ENABLE)
					{
						is_battery_notification_enabled = true;
						DBG_BUFFER(MODULE_APP, LEVEL_INFO, "profile callback BAS_NOTIFY_BATTERY_LEVEL_ENABLE\n", 0);
					}
					else if(pBasCallbackData->msg_data.notification_indification_index == BAS_NOTIFY_BATTERY_LEVEL_DISABLE)
					{
						is_battery_notification_enabled = false;
						DBG_BUFFER(MODULE_APP, LEVEL_INFO, "profile callback BAS_NOTIFY_BATTERY_LEVEL_DISABLE\n", 0);
					}
				}
				break;
    	
			case SERVICE_CALLBACK_TYPE_READ_CHAR_VALUE:
				{
					
					/*check battery level firstly*/
					UpdateBatteryLevel();					
				}
				break;
			default:
				break;
		}
	}
	else if(serviceID == gHRSServiceId)
	{
		THRS_CALLBACK_DATA *pHrsCallbackData = (THRS_CALLBACK_DATA *)pData;

		switch(pHrsCallbackData->msg_type)
		{
			case SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION:
				{
					if(pHrsCallbackData->msg_data.notification_indification_index == HRS_NOTIFY_INDICATE_MEASUREMENT_VALUE_ENABLE)
					{							
						is_heart_rate_service_notification_enabled = true;
						xTimerStart(hPAH8001_Timer, 0);
						DBG_BUFFER(MODULE_APP, LEVEL_INFO, "profile callback HRS_NOTIFY_INDICATE_MEASUREMENT_VALUE_ENABLE\n", 0);

						uTxCnt = sprintf((char *)uTxBuf, "EN1\n\r");	// 啟動 PIC 
						UART_SendData(UART, uTxBuf, uTxCnt);
					}
					else if(pHrsCallbackData->msg_data.notification_indification_index == HRS_NOTIFY_INDICATE_MEASUREMENT_VALUE_DISABLE)
					{
						is_heart_rate_service_notification_enabled = false;
						xTimerStop(hPAH8001_Timer, 0);
						DBG_BUFFER(MODULE_APP, LEVEL_INFO, "profile callback HRS_NOTIFY_INDICATE_MEASUREMENT_VALUE_DISABLE\n", 0);

						uTxCnt = sprintf((char *)uTxBuf, "STP\n\r");	// 關閉 PIC 
						UART_SendData(UART, uTxBuf, uTxCnt);
					}
				}
				break;

			case SERVICE_CALLBACK_TYPE_READ_CHAR_VALUE:
				{
					if(pHrsCallbackData->msg_data.read_value_index == HRS_READ_BODY_SENSOR_LOCATION_VALUE)
					{
						uint8_t BodySenosrLocation = BODY_SENSOR_LOCATION_VALUE_WRIST;

						HRS_SetParameter(HRS_BODY_SENSOR_LOCATION_PARAM_VALUE, 1, &BodySenosrLocation);

						DBG_BUFFER(MODULE_APP, LEVEL_INFO, "profile callback HRS_READ_BODY_SENSOR_LOCATION_VALUE\n", 0);
					}
				}
				break;

			case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:
				{
					if(pHrsCallbackData->msg_data.write.opcode == HRS_HEART_RATE_CP_OPCODE_RESET_ENERGY_EXPENDED)
					{
						DBG_BUFFER(MODULE_APP, LEVEL_INFO, "profile callback HRS_HEART_RATE_CP_OPCODE_RESET_ENERGY_EXPENDED\n", 0);
					}
				}
				break;

			default:
				break;
		}
	}
	else if(serviceID == gOTAServiceId)
	{
		TOTA_CALLBACK_DATA *pOTACallbackData = (TOTA_CALLBACK_DATA *)pData;

		switch(pOTACallbackData->msg_type)
		{
			case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:

				if (OTA_WRITE_CHAR_VAL == pOTACallbackData->msg_data.write.opcode &&
					OTA_VALUE_ENTER == pOTACallbackData->msg_data.write.value)
				{
					/*check battery level firstly*/
					UpdateBatteryLevel();

					if(gBASBatteryLevel > 60)
					{
						/*battery level is above 60 percent*/
						DBG_BUFFER(MODULE_APP, LEVEL_INFO, "Preparing switch into OTA mode\n", 0);

						/*prepare to enter OTA mode, before switch action, we should disconnect first.*/
						gSwitchIntoOtaPending = true;
						peripheral_Disconnect();
					}
					else
					{
						/*battery level is below 60 percent*/
						DBG_BUFFER(MODULE_APP, LEVEL_INFO, "Battery level is not enough to support OTA\n", 0);
					}
				}
				break;

			default:
				break;
		}
	}
	else if(serviceID == gHRMServiceId)
	{
		THRS_CALLBACK_DATA *pHrmCallbackData = (THRS_CALLBACK_DATA *)pData;

		switch(pHrmCallbackData->msg_type)
		{
			case SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION:
				{
					if(pHrmCallbackData->msg_data.notification_indification_index == HRS_NOTIFY_INDICATE_MEASUREMENT_VALUE_ENABLE)
					{
						
						is_heart_rate_monitor_notification_enabled = true;
						
						DBG_BUFFER(MODULE_APP, LEVEL_INFO, "profile callback HRS_NOTIFY_INDICATE_MEASUREMENT_VALUE_ENABLE\n", 0);
					}
					else if(pHrmCallbackData->msg_data.notification_indification_index == HRS_NOTIFY_INDICATE_MEASUREMENT_VALUE_DISABLE)
					{
						is_heart_rate_monitor_notification_enabled = false;
						
						DBG_BUFFER(MODULE_APP, LEVEL_INFO, "profile callback HRS_NOTIFY_INDICATE_MEASUREMENT_VALUE_DISABLE\n", 0);
					}
				}
				break;

			case SERVICE_CALLBACK_TYPE_READ_CHAR_VALUE:
				{
					UpdateHeartRate();
				}
				break;
			default:
				break;
		}
	}

	return appResult;
}

